Periodic_Hill_Charbel/periodicHill/mlSim/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
288000
(
0.0375
0.112501
0.187427
0.261854
0.334808
0.405186
0.472592
0.537405
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
7200
(
0.0375
0.0375
0.0375
0.0375
0.0375
0.0375
0.0375
0.0375
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<scalar> 
7200
(
0.0375
0.0375
0.0375
0.0375
0.0375
0.0375
0.0375
0.0375
...
)
;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
