Periodic_Hill_Charbel/periodicHill/mlSim/0/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
288000
(
1.00637
1.0057
1.00104
0.988
0.963536
0.927589
0.883414
0.834459
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
7200
(
3.035
3.035
3.035
3.035
3.035
3.035
3.035
3.035
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<scalar> 
7200
(
1
1
1
1
1
1
1
1
...
)
;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
